load-test/results/quick_stress-pod-2026-01-13-2333.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/k6-profiles.js
        output: -

     scenarios: (100.00%) 1 scenario, 45 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 45 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-01-14T04:29:46Z" level=info msg="\n=== Load Test: quick_stress ===" source=console
time="2026-01-14T04:29:46Z" level=info msg="Target: http://kata-deploy-sandbox-service.kata-system:8080" source=console
time="2026-01-14T04:29:46Z" level=info msg="Total VUs: 45" source=console
time="2026-01-14T04:29:46Z" level=info msg="  occasional: 10" source=console
time="2026-01-14T04:29:46Z" level=info msg="  steady: 15" source=console
time="2026-01-14T04:29:46Z" level=info msg="  light_python: 10" source=console
time="2026-01-14T04:29:46Z" level=info msg="  heavy_python: 5" source=console
time="2026-01-14T04:29:46Z" level=info msg="  bursty: 5" source=console
time="2026-01-14T04:29:46Z" level=info msg="Service healthy\n" source=console
time="2026-01-14T04:29:47Z" level=info msg="VU 2: occasional" source=console

running (0m00.9s), 01/45 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/45 VUs  0m00.9s/3m00.0s
time="2026-01-14T04:29:47Z" level=info msg="VU 3: occasional" source=console

running (0m01.9s), 02/45 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/45 VUs  0m01.9s/3m00.0s
time="2026-01-14T04:29:48Z" level=info msg="VU 4: occasional" source=console
time="2026-01-14T04:29:49Z" level=info msg="VU 5: occasional" source=console

running (0m02.9s), 04/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/45 VUs  0m02.9s/3m00.0s
time="2026-01-14T04:29:49Z" level=info msg="VU 6: occasional" source=console

running (0m03.9s), 05/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 05/45 VUs  0m03.9s/3m00.0s
time="2026-01-14T04:29:50Z" level=info msg="VU 7: occasional" source=console
time="2026-01-14T04:29:51Z" level=info msg="VU 8: occasional" source=console

running (0m04.9s), 07/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 07/45 VUs  0m04.9s/3m00.0s
time="2026-01-14T04:29:51Z" level=info msg="VU 9: occasional" source=console

running (0m05.9s), 08/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 08/45 VUs  0m05.9s/3m00.0s
time="2026-01-14T04:29:52Z" level=info msg="VU 1: occasional" source=console
time="2026-01-14T04:29:53Z" level=info msg="VU 10: occasional" source=console

running (0m06.9s), 10/45 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10/45 VUs  0m06.9s/3m00.0s
time="2026-01-14T04:29:53Z" level=info msg="VU 11: steady" source=console

running (0m07.9s), 11/45 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 11/45 VUs  0m07.9s/3m00.0s
time="2026-01-14T04:29:54Z" level=info msg="VU 12: steady" source=console
time="2026-01-14T04:29:55Z" level=info msg="VU 13: steady" source=console

running (0m08.9s), 13/45 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 13/45 VUs  0m08.9s/3m00.0s
time="2026-01-14T04:29:55Z" level=info msg="VU 14: steady" source=console

running (0m09.9s), 14/45 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 14/45 VUs  0m09.9s/3m00.0s
time="2026-01-14T04:29:56Z" level=info msg="VU 15: steady" source=console
time="2026-01-14T04:29:57Z" level=info msg="VU 16: steady" source=console

running (0m10.9s), 16/45 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 16/45 VUs  0m10.9s/3m00.0s
time="2026-01-14T04:29:57Z" level=info msg="VU 17: steady" source=console

running (0m11.9s), 17/45 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 17/45 VUs  0m11.9s/3m00.0s
time="2026-01-14T04:29:58Z" level=info msg="VU 18: steady" source=console
time="2026-01-14T04:29:59Z" level=info msg="VU 20: steady" source=console

running (0m12.9s), 19/45 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 19/45 VUs  0m12.9s/3m00.0s
time="2026-01-14T04:29:59Z" level=info msg="VU 21: steady" source=console

running (0m13.9s), 20/45 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 20/45 VUs  0m13.9s/3m00.0s
time="2026-01-14T04:30:00Z" level=info msg="VU 22: steady" source=console
time="2026-01-14T04:30:01Z" level=info msg="VU 23: steady" source=console

running (0m14.9s), 22/45 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 22/45 VUs  0m14.9s/3m00.0s
time="2026-01-14T04:30:01Z" level=info msg="VU 24: steady" source=console

running (0m15.9s), 23/45 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 23/45 VUs  0m15.9s/3m00.0s
time="2026-01-14T04:30:02Z" level=info msg="VU 19: steady" source=console
time="2026-01-14T04:30:03Z" level=info msg="VU 25: steady" source=console

running (0m16.9s), 25/45 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 25/45 VUs  0m16.9s/3m00.0s
time="2026-01-14T04:30:03Z" level=info msg="VU 27: light_python" source=console

running (0m17.9s), 26/45 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 26/45 VUs  0m17.9s/3m00.0s
time="2026-01-14T04:30:04Z" level=info msg="VU 28: light_python" source=console
time="2026-01-14T04:30:05Z" level=info msg="VU 26: light_python" source=console

running (0m18.9s), 28/45 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 28/45 VUs  0m18.9s/3m00.0s
time="2026-01-14T04:30:05Z" level=info msg="VU 29: light_python" source=console

running (0m19.9s), 29/45 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 29/45 VUs  0m19.9s/3m00.0s
time="2026-01-14T04:30:06Z" level=info msg="VU 31: light_python" source=console
time="2026-01-14T04:30:07Z" level=info msg="VU 30: light_python" source=console

running (0m20.9s), 31/45 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 31/45 VUs  0m20.9s/3m00.0s
time="2026-01-14T04:30:07Z" level=info msg="VU 32: light_python" source=console

running (0m21.9s), 32/45 VUs, 1 complete and 0 interrupted iterations
default   [  12% ] 32/45 VUs  0m21.9s/3m00.0s
time="2026-01-14T04:30:08Z" level=info msg="VU 33: light_python" source=console
time="2026-01-14T04:30:09Z" level=info msg="VU 35: light_python" source=console

running (0m22.9s), 34/45 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 34/45 VUs  0m22.9s/3m00.0s
time="2026-01-14T04:30:09Z" level=info msg="VU 34: light_python" source=console

running (0m23.9s), 35/45 VUs, 3 complete and 0 interrupted iterations
default   [  13% ] 35/45 VUs  0m23.9s/3m00.0s
time="2026-01-14T04:30:10Z" level=info msg="VU 36: heavy_python" source=console
time="2026-01-14T04:30:11Z" level=info msg="VU 37: heavy_python" source=console

running (0m24.9s), 37/45 VUs, 3 complete and 0 interrupted iterations
default   [  14% ] 37/45 VUs  0m24.9s/3m00.0s
time="2026-01-14T04:30:11Z" level=info msg="VU 38: heavy_python" source=console

running (0m25.9s), 38/45 VUs, 3 complete and 0 interrupted iterations
default   [  14% ] 38/45 VUs  0m25.9s/3m00.0s
time="2026-01-14T04:30:12Z" level=info msg="VU 40: heavy_python" source=console
time="2026-01-14T04:30:13Z" level=info msg="VU 39: heavy_python" source=console

running (0m26.9s), 40/45 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 40/45 VUs  0m26.9s/3m00.0s
time="2026-01-14T04:30:13Z" level=info msg="VU 42: bursty" source=console

running (0m27.9s), 41/45 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 41/45 VUs  0m27.9s/3m00.0s
time="2026-01-14T04:30:14Z" level=info msg="VU 41: bursty" source=console
time="2026-01-14T04:30:15Z" level=info msg="VU 43: bursty" source=console

running (0m28.9s), 43/45 VUs, 4 complete and 0 interrupted iterations
default   [  16% ] 43/45 VUs  0m28.9s/3m00.0s
time="2026-01-14T04:30:15Z" level=info msg="VU 44: bursty" source=console

running (0m29.9s), 44/45 VUs, 7 complete and 0 interrupted iterations
default   [  17% ] 44/45 VUs  0m29.9s/3m00.0s
time="2026-01-14T04:30:16Z" level=info msg="VU 45: bursty" source=console

running (0m30.9s), 45/45 VUs, 8 complete and 0 interrupted iterations
default   [  17% ] 45/45 VUs  0m30.9s/3m00.0s

running (0m31.9s), 45/45 VUs, 10 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m31.9s/3m00.0s

running (0m32.9s), 45/45 VUs, 11 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m32.9s/3m00.0s

running (0m33.9s), 45/45 VUs, 11 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m33.9s/3m00.0s

running (0m34.9s), 45/45 VUs, 12 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m34.9s/3m00.0s

running (0m35.9s), 45/45 VUs, 12 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m35.9s/3m00.0s

running (0m36.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m36.9s/3m00.0s

running (0m37.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  21% ] 45/45 VUs  0m37.9s/3m00.0s

running (0m38.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m38.9s/3m00.0s

running (0m39.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m39.9s/3m00.0s

running (0m40.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m40.9s/3m00.0s

running (0m41.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m41.9s/3m00.0s

running (0m42.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m42.9s/3m00.0s

running (0m43.9s), 45/45 VUs, 13 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m43.9s/3m00.0s

running (0m44.9s), 45/45 VUs, 14 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m44.9s/3m00.0s

running (0m45.9s), 45/45 VUs, 14 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m45.9s/3m00.0s

running (0m46.9s), 45/45 VUs, 15 complete and 0 interrupted iterations
default   [  26% ] 45/45 VUs  0m46.9s/3m00.0s

running (0m47.9s), 45/45 VUs, 18 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m47.9s/3m00.0s

running (0m48.9s), 45/45 VUs, 20 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m48.9s/3m00.0s

running (0m49.9s), 45/45 VUs, 22 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m49.9s/3m00.0s

running (0m50.9s), 45/45 VUs, 22 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m50.9s/3m00.0s

running (0m51.9s), 45/45 VUs, 22 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m51.9s/3m00.0s

running (0m52.9s), 45/45 VUs, 25 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m52.9s/3m00.0s

running (0m53.9s), 45/45 VUs, 26 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m53.9s/3m00.0s

running (0m54.9s), 45/45 VUs, 30 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m54.9s/3m00.0s

running (0m55.9s), 45/45 VUs, 33 complete and 0 interrupted iterations
default   [  31% ] 45/45 VUs  0m55.9s/3m00.0s

running (0m56.9s), 45/45 VUs, 34 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m56.9s/3m00.0s

running (0m57.9s), 45/45 VUs, 36 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m57.9s/3m00.0s

running (0m58.9s), 45/45 VUs, 37 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m58.9s/3m00.0s

running (0m59.9s), 45/45 VUs, 40 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m59.9s/3m00.0s

running (1m00.9s), 45/45 VUs, 44 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m00.9s/3m00.0s

running (1m01.9s), 45/45 VUs, 46 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m01.9s/3m00.0s

running (1m02.9s), 45/45 VUs, 47 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m02.9s/3m00.0s

running (1m03.9s), 45/45 VUs, 48 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m03.9s/3m00.0s

running (1m04.9s), 45/45 VUs, 49 complete and 0 interrupted iterations
default   [  36% ] 45/45 VUs  1m04.9s/3m00.0s

running (1m05.9s), 45/45 VUs, 52 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m05.9s/3m00.0s

running (1m06.9s), 45/45 VUs, 55 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m06.9s/3m00.0s

running (1m07.9s), 45/45 VUs, 57 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m07.9s/3m00.0s

running (1m08.9s), 45/45 VUs, 58 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m08.9s/3m00.0s

running (1m09.9s), 45/45 VUs, 59 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m09.9s/3m00.0s

running (1m10.9s), 45/45 VUs, 62 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m10.9s/3m00.0s

running (1m11.9s), 45/45 VUs, 62 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m11.9s/3m00.0s

running (1m12.9s), 45/45 VUs, 64 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m12.9s/3m00.0s

running (1m13.9s), 45/45 VUs, 65 complete and 0 interrupted iterations
default   [  41% ] 45/45 VUs  1m13.9s/3m00.0s

running (1m14.9s), 45/45 VUs, 67 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m14.9s/3m00.0s

running (1m15.9s), 45/45 VUs, 67 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m15.9s/3m00.0s

running (1m16.9s), 45/45 VUs, 69 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m16.9s/3m00.0s

running (1m17.9s), 45/45 VUs, 73 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m17.9s/3m00.0s

running (1m18.9s), 45/45 VUs, 77 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m18.9s/3m00.0s

running (1m19.9s), 45/45 VUs, 79 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m19.9s/3m00.0s

running (1m20.9s), 45/45 VUs, 83 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m20.9s/3m00.0s

running (1m21.9s), 45/45 VUs, 85 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m21.9s/3m00.0s

running (1m22.9s), 45/45 VUs, 90 complete and 0 interrupted iterations
default   [  46% ] 45/45 VUs  1m22.9s/3m00.0s

running (1m23.9s), 45/45 VUs, 92 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m23.9s/3m00.0s

running (1m24.9s), 45/45 VUs, 92 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m24.9s/3m00.0s

running (1m25.9s), 45/45 VUs, 94 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m25.9s/3m00.0s

running (1m26.9s), 45/45 VUs, 97 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m26.9s/3m00.0s

running (1m27.9s), 45/45 VUs, 98 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m27.9s/3m00.0s

running (1m28.9s), 45/45 VUs, 103 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m28.9s/3m00.0s

running (1m29.9s), 45/45 VUs, 105 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m29.9s/3m00.0s

running (1m30.9s), 45/45 VUs, 106 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m30.9s/3m00.0s

running (1m31.9s), 45/45 VUs, 109 complete and 0 interrupted iterations
default   [  51% ] 45/45 VUs  1m31.9s/3m00.0s

running (1m32.9s), 45/45 VUs, 114 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m32.9s/3m00.0s

running (1m33.9s), 45/45 VUs, 115 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m33.9s/3m00.0s

running (1m34.9s), 45/45 VUs, 117 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m34.9s/3m00.0s

running (1m35.9s), 45/45 VUs, 119 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m35.9s/3m00.0s

running (1m36.9s), 45/45 VUs, 121 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m36.9s/3m00.0s

running (1m37.9s), 45/45 VUs, 126 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m37.9s/3m00.0s

running (1m38.9s), 45/45 VUs, 129 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m38.9s/3m00.0s

running (1m39.9s), 45/45 VUs, 133 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m39.9s/3m00.0s

running (1m40.9s), 45/45 VUs, 134 complete and 0 interrupted iterations
default   [  56% ] 45/45 VUs  1m40.9s/3m00.0s

running (1m41.9s), 45/45 VUs, 138 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m41.9s/3m00.0s

running (1m42.9s), 45/45 VUs, 141 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m42.9s/3m00.0s

running (1m43.9s), 45/45 VUs, 146 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m43.9s/3m00.0s

running (1m44.9s), 45/45 VUs, 147 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m44.9s/3m00.0s

running (1m45.9s), 45/45 VUs, 148 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m45.9s/3m00.0s

running (1m46.9s), 45/45 VUs, 151 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m46.9s/3m00.0s

running (1m47.9s), 45/45 VUs, 153 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m47.9s/3m00.0s

running (1m48.9s), 45/45 VUs, 155 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m48.9s/3m00.0s

running (1m49.9s), 45/45 VUs, 161 complete and 0 interrupted iterations
default   [  61% ] 45/45 VUs  1m49.9s/3m00.0s

running (1m50.9s), 45/45 VUs, 164 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m50.9s/3m00.0s

running (1m51.9s), 45/45 VUs, 166 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m51.9s/3m00.0s

running (1m52.9s), 45/45 VUs, 168 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m52.9s/3m00.0s

running (1m53.9s), 45/45 VUs, 172 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m53.9s/3m00.0s

running (1m54.9s), 45/45 VUs, 172 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m54.9s/3m00.0s

running (1m55.9s), 45/45 VUs, 177 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m55.9s/3m00.0s

running (1m56.9s), 45/45 VUs, 179 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m56.9s/3m00.0s

running (1m57.9s), 45/45 VUs, 180 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m57.9s/3m00.0s

running (1m58.9s), 45/45 VUs, 183 complete and 0 interrupted iterations
default   [  66% ] 45/45 VUs  1m58.9s/3m00.0s

running (1m59.9s), 45/45 VUs, 185 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  1m59.9s/3m00.0s

running (2m00.9s), 45/45 VUs, 187 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  2m00.9s/3m00.0s

running (2m01.9s), 45/45 VUs, 188 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m01.9s/3m00.0s

running (2m02.9s), 45/45 VUs, 191 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m02.9s/3m00.0s

running (2m03.9s), 45/45 VUs, 194 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m03.9s/3m00.0s

running (2m04.9s), 45/45 VUs, 196 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m04.9s/3m00.0s

running (2m05.9s), 45/45 VUs, 198 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m05.9s/3m00.0s

running (2m06.9s), 45/45 VUs, 200 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m06.9s/3m00.0s

running (2m07.9s), 45/45 VUs, 200 complete and 0 interrupted iterations
default   [  71% ] 45/45 VUs  2m07.9s/3m00.0s

running (2m08.9s), 45/45 VUs, 203 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m08.9s/3m00.0s

running (2m09.9s), 45/45 VUs, 205 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m09.9s/3m00.0s

running (2m10.9s), 45/45 VUs, 206 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m10.9s/3m00.0s

running (2m11.9s), 45/45 VUs, 211 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m11.9s/3m00.0s

running (2m12.9s), 45/45 VUs, 212 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m12.9s/3m00.0s

running (2m13.9s), 45/45 VUs, 213 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m13.9s/3m00.0s

running (2m14.9s), 45/45 VUs, 216 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m14.9s/3m00.0s

running (2m15.9s), 45/45 VUs, 219 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m15.9s/3m00.0s

running (2m16.9s), 45/45 VUs, 224 complete and 0 interrupted iterations
default   [  76% ] 45/45 VUs  2m16.9s/3m00.0s

running (2m17.9s), 45/45 VUs, 226 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m17.9s/3m00.0s

running (2m18.9s), 45/45 VUs, 228 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m18.9s/3m00.0s

running (2m19.9s), 45/45 VUs, 230 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m19.9s/3m00.0s

running (2m20.9s), 45/45 VUs, 233 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m20.9s/3m00.0s

running (2m21.9s), 45/45 VUs, 239 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m21.9s/3m00.0s

running (2m22.9s), 45/45 VUs, 241 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m22.9s/3m00.0s

running (2m23.9s), 45/45 VUs, 247 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m23.9s/3m00.0s

running (2m24.9s), 45/45 VUs, 248 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m24.9s/3m00.0s

running (2m25.9s), 45/45 VUs, 250 complete and 0 interrupted iterations
default   [  81% ] 45/45 VUs  2m25.9s/3m00.0s

running (2m26.9s), 45/45 VUs, 253 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m26.9s/3m00.0s

running (2m27.9s), 45/45 VUs, 254 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m27.9s/3m00.0s

running (2m28.9s), 45/45 VUs, 255 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m28.9s/3m00.0s

running (2m29.9s), 45/45 VUs, 257 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m29.9s/3m00.0s

running (2m30.9s), 45/45 VUs, 259 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m30.9s/3m00.0s

running (2m31.9s), 45/45 VUs, 261 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m31.9s/3m00.0s

running (2m32.9s), 45/45 VUs, 265 complete and 0 interrupted iterations
default   [  85% ] 45/45 VUs  2m32.9s/3m00.0s

running (2m33.9s), 45/45 VUs, 269 complete and 0 interrupted iterations
default   [  85% ] 45/45 VUs  2m33.9s/3m00.0s

running (2m34.9s), 44/45 VUs, 272 complete and 0 interrupted iterations
default   [  86% ] 44/45 VUs  2m34.9s/3m00.0s

running (2m35.9s), 43/45 VUs, 278 complete and 0 interrupted iterations
default   [  87% ] 43/45 VUs  2m35.9s/3m00.0s

running (2m36.9s), 43/45 VUs, 279 complete and 0 interrupted iterations
default   [  87% ] 43/45 VUs  2m36.9s/3m00.0s

running (2m37.9s), 42/45 VUs, 282 complete and 0 interrupted iterations
default   [  88% ] 42/45 VUs  2m37.9s/3m00.0s

running (2m38.9s), 42/45 VUs, 283 complete and 0 interrupted iterations
default   [  88% ] 42/45 VUs  2m38.9s/3m00.0s

running (2m39.9s), 41/45 VUs, 286 complete and 0 interrupted iterations
default   [  89% ] 41/45 VUs  2m39.9s/3m00.0s

running (2m40.9s), 39/45 VUs, 288 complete and 0 interrupted iterations
default   [  89% ] 39/45 VUs  2m40.9s/3m00.0s

running (2m41.9s), 39/45 VUs, 290 complete and 0 interrupted iterations
default   [  90% ] 39/45 VUs  2m41.9s/3m00.0s

running (2m42.9s), 38/45 VUs, 293 complete and 0 interrupted iterations
default   [  90% ] 38/45 VUs  2m42.9s/3m00.0s

running (2m43.9s), 36/45 VUs, 295 complete and 0 interrupted iterations
default   [  91% ] 36/45 VUs  2m43.9s/3m00.0s

running (2m44.9s), 35/45 VUs, 296 complete and 0 interrupted iterations
default   [  92% ] 35/45 VUs  2m44.9s/3m00.0s

running (2m45.9s), 34/45 VUs, 300 complete and 0 interrupted iterations
default   [  92% ] 34/45 VUs  2m45.9s/3m00.0s

running (2m46.9s), 33/45 VUs, 302 complete and 0 interrupted iterations
default   [  93% ] 33/45 VUs  2m46.9s/3m00.0s

running (2m47.9s), 31/45 VUs, 305 complete and 0 interrupted iterations
default   [  93% ] 31/45 VUs  2m47.9s/3m00.0s

running (2m48.9s), 28/45 VUs, 308 complete and 0 interrupted iterations
default   [  94% ] 28/45 VUs  2m48.9s/3m00.0s

running (2m49.9s), 28/45 VUs, 308 complete and 0 interrupted iterations
default   [  94% ] 28/45 VUs  2m49.9s/3m00.0s

running (2m50.9s), 26/45 VUs, 311 complete and 0 interrupted iterations
default   [  95% ] 26/45 VUs  2m50.9s/3m00.0s

running (2m51.9s), 26/45 VUs, 312 complete and 0 interrupted iterations
default   [  95% ] 26/45 VUs  2m51.9s/3m00.0s

running (2m52.9s), 25/45 VUs, 313 complete and 0 interrupted iterations
default   [  96% ] 25/45 VUs  2m52.9s/3m00.0s

running (2m53.9s), 22/45 VUs, 317 complete and 0 interrupted iterations
default   [  97% ] 22/45 VUs  2m53.9s/3m00.0s

running (2m54.9s), 21/45 VUs, 319 complete and 0 interrupted iterations
default   [  97% ] 21/45 VUs  2m54.9s/3m00.0s

running (2m55.9s), 20/45 VUs, 322 complete and 0 interrupted iterations
default   [  98% ] 20/45 VUs  2m55.9s/3m00.0s

running (2m56.9s), 17/45 VUs, 325 complete and 0 interrupted iterations
default   [  98% ] 17/45 VUs  2m56.9s/3m00.0s

running (2m57.9s), 15/45 VUs, 327 complete and 0 interrupted iterations
default   [  99% ] 15/45 VUs  2m57.9s/3m00.0s

running (2m58.9s), 14/45 VUs, 328 complete and 0 interrupted iterations
default   [  99% ] 14/45 VUs  2m58.9s/3m00.0s

running (2m59.9s), 13/45 VUs, 329 complete and 0 interrupted iterations
default   [ 100% ] 13/45 VUs  2m59.9s/3m00.0s

running (3m00.9s), 12/45 VUs, 330 complete and 0 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m01.9s), 11/45 VUs, 330 complete and 1 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m02.9s), 08/45 VUs, 332 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m03.9s), 08/45 VUs, 332 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m04.9s), 08/45 VUs, 332 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m05.9s), 07/45 VUs, 333 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m06.9s), 07/45 VUs, 333 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m07.9s), 07/45 VUs, 333 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m08.9s), 07/45 VUs, 333 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m09.9s), 05/45 VUs, 335 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m10.9s), 05/45 VUs, 335 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m11.9s), 04/45 VUs, 336 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m12.9s), 04/45 VUs, 336 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m13.9s), 04/45 VUs, 336 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m14.9s), 04/45 VUs, 336 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m15.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m16.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m17.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m18.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m19.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m20.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m21.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m22.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s

running (3m23.9s), 02/45 VUs, 338 complete and 2 interrupted iterations
default ↓ [ 100% ] 13/45 VUs  3m0s
time="2026-01-14T04:33:11Z" level=info msg="\nCompleted in 204.9s" source=console

running (3m24.9s), 00/45 VUs, 340 complete and 2 interrupted iterations
default ✓ [ 100% ] 00/45 VUs  3m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<5000' p(95)=12.77s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    success_rate
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 701     3.421566/s
    checks_succeeded...: 100.00% 701 out of 701
    checks_failed......: 0.00%   0 out of 701

    ✓ sandbox created
    ✓ shell ok
    ✓ python ok

    CUSTOM
    command_latency................: avg=3.85s  min=29ms   med=3.19s  max=19.39s p(90)=5.83s  p(95)=10.29s
    commands_executed..............: 656     3.201922/s
    python_latency.................: avg=4.35s  min=42ms   med=3.49s  max=14.25s p(90)=9.63s  p(95)=11.99s
    sandbox_create_latency.........: avg=6.87s  min=1.27s  med=5.7s   max=15.3s  p(90)=14.25s p(95)=14.48s
    success_rate...................: 100.00% 701 out of 701

    HTTP
    http_req_duration..............: avg=4.21s  min=1.43ms med=3.31s  max=19.39s p(90)=8.57s  p(95)=12.77s
      { expected_response:true }...: avg=4.21s  min=1.43ms med=3.31s  max=19.39s p(90)=8.57s  p(95)=12.77s
    http_req_failed................: 0.00%   0 out of 702
    http_reqs......................: 702     3.426447/s

    EXECUTION
    iteration_duration.............: avg=20.89s min=6.81s  med=18.14s max=1m20s  p(90)=34.19s p(95)=40.3s 
    iterations.....................: 340     1.659533/s
    vus............................: 2       min=1          max=45
    vus_max........................: 45      min=45         max=45

    NETWORK
    data_received..................: 199 kB  969 B/s
    data_sent......................: 160 kB  779 B/s



running (3m24.9s), 00/45 VUs, 340 complete and 2 interrupted iterations
default ✓ [ 100% ] 00/45 VUs  3m0s
time="2026-01-14T04:33:11Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"